OpenFOAM-10/tutorials/combustion/buoyantReactingFoam/Lagrangian/hotBoxes/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    walls
    {
        type            fixedValue;
        value           uniform 300;
    }

    "(region0_to.*)"
    {
        type            mapped;
        field           T;
        average         300;
        setAverage      no;
        value           uniform 300;
    }
}


// ************************************************************************* //
